<a href="https://colab.research.google.com/github/anew0m/ABOOK_Pandas-basic/blob/main/02_SubsetObservations(Rows)/5)_head%2C_tail%EB%A1%9C_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%AF%B8%EB%A6%AC%EB%B3%B4%EA%B8%B0_df_sample(frac%3D0_5)%2C_df_sample(n%3D10)%2C_df_nlargest%2C_df_nsmallest.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 5) head, tail로 데이터 미리보기 df.sample(frac=0.5), df.sample(n=10), df.nlargest, df.nsmallest

In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame (
    { "a" : [4, 5, 6, 6, np.nan], 
     "b" : [7, 8, np.nan, 9, 9],
     "c" : [10, 11, 12, np.nan, 12]},
     index = pd.MultiIndex.from_tuples (
         [('d', 1), ('d', 2), ('e', 2), ('e', 3), ('e', 4)], 
         names = ['n', 'v']
     )
)

df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [4]:
df.head?

In [5]:
df.head(3)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [6]:
df.tail(3)

       a    b     c
n v
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [10]:
df.sample(frac=0.5)

       a    b     c
n v
e 3  6.0  9.0   NaN
d 2  5.0  8.0  11.0

In [13]:
df.sample(frac=0.7)

       a    b     c
n v
e 4  NaN  9.0  12.0
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [14]:
df.sample(frac=0.7)

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [15]:
df.sample(frac=0.7)

       a    b     c
n v
e 2  6.0  NaN  12.0
d 2  5.0  8.0  11.0
  1  4.0  7.0  10.0
e 3  6.0  9.0   NaN

In [17]:
df.sample(frac=0.3)

       a    b     c
n v
d 1  4.0  7.0  10.0
e 4  NaN  9.0  12.0

In [18]:
df.sample(frac=0.3)

       a    b     c
n v
e 4  NaN  9.0  12.0
  3  6.0  9.0   NaN

In [19]:
df.sample(frac=0.3)

       a    b     c
n v
e 4  NaN  9.0  12.0
d 1  4.0  7.0  10.0

In [20]:
df.sample(frac=1)

       a    b     c
n v
d 1  4.0  7.0  10.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
d 2  5.0  8.0  11.0
e 4  NaN  9.0  12.0

In [21]:
df.sample(frac=1)

       a    b     c
n v
e 3  6.0  9.0   NaN
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
d 1  4.0  7.0  10.0
e 4  NaN  9.0  12.0

In [22]:
df.sample(n = 10)

ValueError: ignored

In [23]:
df.sample(n = 3)

       a    b     c
n v
e 4  NaN  9.0  12.0
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [24]:
df.iloc(0.5)

ValueError: ignored

In [27]:
df.iloc[10:20]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [28]:
df.iloc[1:2]

       a    b     c
n v
d 2  5.0  8.0  11.0

In [29]:
df.iloc[:2]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [30]:
df.iloc[2:]

       a    b     c
n v
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [31]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [34]:
df.nlargest?

In [37]:
import pandas as pd

df = pd.DataFrame(
    {
        'a' : [1, 10, 8, 11, -1],
     'b' : list('abcde'),
     'c' : [1.0, 2.0, np.nan, 3.0, 4.0]
    }
)
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  c  NaN
3  11  d  3.0
4  -1  e  4.0

In [38]:
import pandas as pd

df = pd.DataFrame({'population': [59000000, 65000000, 434000,
                                  434000, 434000, 337000, 11300,
                                  11300, 11300],
                   'GDP': [1937894, 2583560 , 12011, 4520, 12128,
                           17036, 182, 38, 311],
                   'alpha-2': ["IT", "FR", "MT", "MV", "BN",
                               "IS", "NR", "TV", "AI"]},
                  index=["Italy", "France", "Malta",
                         "Maldives", "Brunei", "Iceland",
                         "Nauru", "Tuvalu", "Anguilla"])
df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [39]:
df.nlargest(3, 'population')

        population      GDP alpha-2
France    65000000  2583560      FR
Italy     59000000  1937894      IT
Malta       434000    12011      MT

In [40]:
df.nlargest(2, 'population')

        population      GDP alpha-2
France    65000000  2583560      FR
Italy     59000000  1937894      IT

In [41]:
df.nlargest(2, 'alpha-2')

TypeError: ignored

* 데이터 타입이 숫자일떄만 사용가능

In [42]:
df.nsmallest?

In [43]:
df = pd.DataFrame({'population': [59000000, 65000000, 434000,
                                  434000, 434000, 337000, 337000,
                                  11300, 11300],
                   'GDP': [1937894, 2583560 , 12011, 4520, 12128,
                           17036, 182, 38, 311],
                   'alpha-2': ["IT", "FR", "MT", "MV", "BN",
                               "IS", "NR", "TV", "AI"]},
                  index=["Italy", "France", "Malta",
                         "Maldives", "Brunei", "Iceland",
                         "Nauru", "Tuvalu", "Anguilla"])
df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru         337000      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [44]:
df.nsmallest(3, 'population')

          population    GDP alpha-2
Tuvalu         11300     38      TV
Anguilla       11300    311      AI
Iceland       337000  17036      IS

In [45]:
df.nsmallest(3, 'population', keep='last')

          population  GDP alpha-2
Anguilla       11300  311      AI
Tuvalu         11300   38      TV
Nauru         337000  182      NR

In [46]:
df.nsmallest(3, 'population', keep='first')

          population    GDP alpha-2
Tuvalu         11300     38      TV
Anguilla       11300    311      AI
Iceland       337000  17036      IS

In [47]:
df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru         337000      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [48]:
df.iloc[2:]

          population    GDP alpha-2
Malta         434000  12011      MT
Maldives      434000   4520      MV
Brunei        434000  12128      BN
Iceland       337000  17036      IS
Nauru         337000    182      NR
Tuvalu         11300     38      TV
Anguilla       11300    311      AI

In [49]:
df.iloc[-2:]

          population  GDP alpha-2
Tuvalu         11300   38      TV
Anguilla       11300  311      AI